sysbench_test_OpenGauss_High_Frequency.log
========================================
Sysbench Test Parameters:
TABLES=5, TABLE_SIZE=10000, THREADS=50, TIME=300, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=5 --table-size=10000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 10000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=5 --table-size=10000 --threads=50 --time=300 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 50 tps: 2066.27 qps: 41514.76 (r/w/o: 29078.78/8271.56/4164.42) lat (ms,95%): 37.56 err/s: 6.60 reconn/s: 0.00
[ 20s ] thds: 50 tps: 1779.06 qps: 35726.46 (r/w/o: 25022.31/7114.22/3589.92) lat (ms,95%): 36.89 err/s: 8.30 reconn/s: 0.00
[ 30s ] thds: 50 tps: 1567.32 qps: 31469.65 (r/w/o: 22037.11/6271.39/3161.14) lat (ms,95%): 34.33 err/s: 6.60 reconn/s: 0.00
[ 40s ] thds: 50 tps: 2001.68 qps: 40169.02 (r/w/o: 28130.14/8006.22/4032.66) lat (ms,95%): 36.89 err/s: 8.10 reconn/s: 0.00
[ 50s ] thds: 50 tps: 1235.21 qps: 24816.97 (r/w/o: 17383.72/4943.23/2490.02) lat (ms,95%): 54.83 err/s: 5.30 reconn/s: 0.00
[ 60s ] thds: 50 tps: 1061.39 qps: 21309.02 (r/w/o: 14920.77/4247.56/2140.68) lat (ms,95%): 77.19 err/s: 5.20 reconn/s: 0.00
[ 70s ] thds: 50 tps: 937.90 qps: 18819.78 (r/w/o: 13178.58/3751.30/1889.90) lat (ms,95%): 92.42 err/s: 3.50 reconn/s: 0.00
[ 80s ] thds: 50 tps: 852.69 qps: 17089.29 (r/w/o: 11965.52/3409.28/1714.49) lat (ms,95%): 104.84 err/s: 2.10 reconn/s: 0.00
[ 90s ] thds: 50 tps: 785.58 qps: 15767.36 (r/w/o: 11042.96/3142.93/1581.47) lat (ms,95%): 116.80 err/s: 2.90 reconn/s: 0.00
[ 100s ] thds: 50 tps: 756.23 qps: 15149.83 (r/w/o: 10605.04/3024.23/1520.56) lat (ms,95%): 116.80 err/s: 1.90 reconn/s: 0.00
[ 110s ] thds: 50 tps: 786.09 qps: 15770.96 (r/w/o: 11043.60/3145.07/1582.29) lat (ms,95%): 116.80 err/s: 2.30 reconn/s: 0.00
[ 120s ] thds: 50 tps: 735.90 qps: 14760.64 (r/w/o: 10338.16/2941.19/1481.29) lat (ms,95%): 127.81 err/s: 2.60 reconn/s: 0.00
[ 130s ] thds: 50 tps: 728.70 qps: 14630.45 (r/w/o: 10243.77/2918.19/1468.50) lat (ms,95%): 130.13 err/s: 3.00 reconn/s: 0.00
[ 140s ] thds: 50 tps: 703.10 qps: 14099.06 (r/w/o: 9872.07/2811.59/1415.40) lat (ms,95%): 130.13 err/s: 1.90 reconn/s: 0.00
[ 150s ] thds: 50 tps: 699.20 qps: 14024.94 (r/w/o: 9820.03/2796.81/1408.10) lat (ms,95%): 139.85 err/s: 3.00 reconn/s: 0.00
[ 160s ] thds: 50 tps: 688.01 qps: 13820.02 (r/w/o: 9679.58/2753.92/1386.51) lat (ms,95%): 132.49 err/s: 2.90 reconn/s: 0.00
[ 170s ] thds: 50 tps: 662.87 qps: 13294.00 (r/w/o: 9309.28/2649.98/1334.74) lat (ms,95%): 137.35 err/s: 2.00 reconn/s: 0.00
[ 180s ] thds: 50 tps: 585.81 qps: 11783.93 (r/w/o: 8254.76/2345.44/1183.72) lat (ms,95%): 150.29 err/s: 3.70 reconn/s: 0.00
[ 190s ] thds: 50 tps: 679.58 qps: 13624.31 (r/w/o: 9538.83/2718.92/1366.56) lat (ms,95%): 142.39 err/s: 1.80 reconn/s: 0.00
[ 200s ] thds: 50 tps: 690.62 qps: 13854.29 (r/w/o: 9701.67/2763.28/1389.34) lat (ms,95%): 137.35 err/s: 2.30 reconn/s: 0.00
[ 210s ] thds: 50 tps: 663.00 qps: 13298.90 (r/w/o: 9313.60/2651.20/1334.10) lat (ms,95%): 144.97 err/s: 2.20 reconn/s: 0.00
[ 220s ] thds: 50 tps: 692.40 qps: 13914.37 (r/w/o: 9744.68/2773.09/1396.60) lat (ms,95%): 137.35 err/s: 3.60 reconn/s: 0.00
[ 230s ] thds: 50 tps: 635.10 qps: 12734.02 (r/w/o: 8916.81/2538.20/1279.00) lat (ms,95%): 155.80 err/s: 2.20 reconn/s: 0.00
[ 240s ] thds: 50 tps: 656.00 qps: 13142.10 (r/w/o: 9201.50/2622.10/1318.50) lat (ms,95%): 144.97 err/s: 1.30 reconn/s: 0.00
[ 250s ] thds: 50 tps: 688.30 qps: 13802.70 (r/w/o: 9663.50/2755.80/1383.40) lat (ms,95%): 139.85 err/s: 1.60 reconn/s: 0.00
[ 260s ] thds: 50 tps: 686.10 qps: 13758.89 (r/w/o: 9633.30/2746.10/1379.50) lat (ms,95%): 139.85 err/s: 1.80 reconn/s: 0.00
[ 270s ] thds: 50 tps: 718.00 qps: 14380.41 (r/w/o: 10069.44/2867.28/1443.69) lat (ms,95%): 132.49 err/s: 1.70 reconn/s: 0.00
[ 280s ] thds: 50 tps: 767.10 qps: 15387.65 (r/w/o: 10774.63/3070.11/1542.90) lat (ms,95%): 121.08 err/s: 2.30 reconn/s: 0.00
[ 290s ] thds: 50 tps: 827.99 qps: 16606.80 (r/w/o: 11626.96/3314.36/1665.48) lat (ms,95%): 106.75 err/s: 2.40 reconn/s: 0.00
[ 300s ] thds: 50 tps: 861.21 qps: 17280.94 (r/w/o: 12103.17/3443.85/1733.92) lat (ms,95%): 104.84 err/s: 3.40 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3822308
        write:                           1088272
        other:                           547844
        total:                           5458424
    transactions:                        272037 (906.58 per sec.)
    queries:                             5458424 (18190.62 per sec.)
    ignored errors:                      985    (3.28 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0673s
    total number of events:              272037

Latency (ms):
         min:                                  6.71
         avg:                                 55.14
         max:                               2996.71
         95th percentile:                    118.92
         sum:                            15000374.16

Threads fairness:
    events (avg/stddev):           5440.7400/37.98
    execution time (avg/stddev):   300.0075/0.02

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=5 --table-size=10000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241220_133502.log